## Python statistics essential training - 02_05_challenge

Standard imports

In [17]:
import numpy as np
import pandas as pd

import matplotlib
import matplotlib.pyplot as pp
import re

%matplotlib inline

In [4]:
tb = pd.read_csv('tb.csv')

In [5]:
tb.columns

Index(['country', 'year', 'm04', 'm514', 'm014', 'm1524', 'm2534', 'm3544',
       'm4554', 'm5564', 'm65', 'mu', 'f04', 'f514', 'f014', 'f1524', 'f2534',
       'f3544', 'f4554', 'f5564', 'f65', 'fu'],
      dtype='object')

In [ ]:
tb['']

In [11]:
tbmelt = tb.melt(['country', 'year'], ['m04', 'm514', 'm014', 'm1524', 'm2534', 'm3544',
       'm4554', 'm5564', 'm65', 'mu', 'f04', 'f514', 'f014', 'f1524', 'f2534',
       'f3544', 'f4554', 'f5564', 'f65', 'fu'], 'sex', 'cases')

In [12]:
tbmelt

       country  year  sex  cases
0           AD  1989  m04    NaN
1           AD  1990  m04    NaN
2           AD  1991  m04    NaN
3           AD  1992  m04    NaN
4           AD  1993  m04    NaN
...        ...   ...  ...    ...
115375      ZW  2004   fu    NaN
115376      ZW  2005   fu    NaN
115377      ZW  2006   fu    NaN
115378      ZW  2007   fu    NaN
115379      ZW  2008   fu    0.0

[115380 rows x 4 columns]

In [15]:
tbmelt['age'] = tbmelt['sex'].apply(lambda x: x[1:])

In [22]:
tbmelt['sex'] = tbmelt['sex'].apply(lambda x: 'm' if re.search('m', x) else 'f')

In [25]:
tbmelt.dropna(inplace=True)

In [27]:
tbmelt['age'].value_counts()

4554    4794
3544    4785
5564    4780
2534    4780
65      4776
1524    4773
014     4731
514      805
04       785
u        543
Name: age, dtype: int64

In [28]:
age = {'4554': '45-54', '3544': '35-44', '5564': '55-64', '2534': '25-34', '65': '65', '1524': '15-24', '014': '0-14', '514': '5-14', '04': '0-4', 'u': 'over 65'}

In [29]:
tbmelt['age'] = tbmelt['age'].map(age)

In [31]:
tbmelt.reset_index(inplace=True)

In [37]:
tbmelt.drop('index', 1, inplace=True)

In [38]:
tbmelt

      country  year sex  cases      age
0          AD  2005   m    0.0      0-4
1          AD  2006   m    0.0      0-4
2          AD  2008   m    0.0      0-4
3          AE  2006   m    0.0      0-4
4          AE  2007   m    0.0      0-4
...       ...   ...  ..    ...      ...
35547      VU  2008   f    0.0  over 65
35548      YE  2008   f    0.0  over 65
35549      ZA  2008   f    0.0  over 65
35550      ZM  2008   f    0.0  over 65
35551      ZW  2008   f    0.0  over 65

[35552 rows x 5 columns]